app/Services/CheckoutEnrollmentService.php

SELECT *
FROM `enrollments`
WHERE `id_student_enrollment` = 105
AND `id_course_enrollment` = 26
AND `status_enrollment` = 'ativa'
 LIMIT 1
---
    public function hasActiveEnrollment(int $userId, int $courseId): bool
    {
        return (new EnrollmentModel())
            ->where('id_student_enrollment', $userId)
            ->where('id_course_enrollment', $courseId)
            ->where('status_enrollment', 'ativa')
            ->first() !== null;

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 105
---
    public function prepareCheckoutUser(
        string $email,
        string $fullName,
        ?object $authenticatedUser = null,
        int $preferredUserId = 0
    ): object {
        $user = $authenticatedUser;

        if (! $user && $preferredUserId > 0) {
            $user = (new ShieldUserModel())->find($preferredUserId);