app/Controllers/Admin/Dashboard.php

        $activity = [];

        try {
            $activeUsers = (int) $db->table('users')->where('active', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `active` = 1

        }

        try {
            $enrollmentsLast30 = (int) $db->table('enrollments')
                ->where('created_at >=', $since30)
                ->countAllResults();
            $enrollmentsPrev30 = (int) $db->table('enrollments')
                ->where('created_at >=', $sincePrev30)
                ->where('created_at <', $untilPrev30)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `created_at` >= '2026-04-20 11:48:28'
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `created_at` >= '2026-03-21 11:48:28'
AND `created_at` < '2026-04-20 11:48:28'

        }

        try {
            $row = $db->table('payments')
                ->selectSum('amount_payment', 'total')
                ->where('status_payment', 'Aprovado')
                ->where('created_at >=', $monthStart)
                ->where('created_at <', $nextMonthStart)
                ->get()
                ->getRowArray();
---
SELECT SUM(`amount_payment`) AS `total`
FROM `payments`
WHERE `status_payment` = 'Aprovado'
AND `created_at` >= '2026-05-01 00:00:00'
AND `created_at` < '2026-06-01 00:00:00'

        }

        try {
            $row = $db->table('payments')
                ->selectSum('amount_payment', 'total')
                ->where('status_payment', 'Aprovado')
                ->where('created_at >=', $prevMonthStart)
                ->where('created_at <', $monthStart)
                ->get()
                ->getRowArray();
---
SELECT SUM(`amount_payment`) AS `total`
FROM `payments`
WHERE `status_payment` = 'Aprovado'
AND `created_at` >= '2026-04-01 00:00:00'
AND `created_at` < '2026-05-01 00:00:00'

        }

        try {
            $activeCourses = (int) $db->table('courses')->where('status_course', 'Ativo')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `courses`
WHERE `status_course` = 'Ativo'

        }

        try {
            $rows = $db->table('courses c')
                ->select('c.id_course, c.title_course AS name, COUNT(DISTINCT e.id_student_enrollment) AS students, AVG(e.progress_enrollment) AS progress', false)
                ->join('enrollments e', 'e.id_course_enrollment = c.id_course AND e.status_enrollment = "ativa"', 'left', false)
                ->groupBy('c.id_course')
                ->orderBy('students', 'DESC')
                ->limit(5)
                ->get()
                ->getResultArray();
---
SELECT c.id_course, c.title_course AS name, COUNT(DISTINCT e.id_student_enrollment) AS students, AVG(e.progress_enrollment) AS progress
FROM `courses` `c`
LEFT JOIN enrollments e ON e.id_course_enrollment = c.id_course AND e.status_enrollment = "ativa"
GROUP BY `c`.`id_course`
ORDER BY `students` DESC
 LIMIT 5

        }

        try {
            $logs = $db->table('audit_logs')
                ->select('event_audit_log, level_audit_log, message_audit_log, created_at')
                ->orderBy('created_at', 'DESC')
                ->limit(6)
                ->get()
                ->getResultArray();
---
SELECT `event_audit_log`, `level_audit_log`, `message_audit_log`, `created_at`
FROM `audit_logs`
ORDER BY `created_at` DESC
 LIMIT 6

            $start12 = strtotime('-11 months', $startMonth);
            $start12Dt = date('Y-m-01 00:00:00', $start12);

            $revRows = $db->table('payments')
                ->select('DATE_FORMAT(created_at, "%Y-%m") AS ym, SUM(amount_payment) AS total', false)
                ->where('status_payment', 'Aprovado')
                ->where('created_at >=', $start12Dt)
                ->groupBy('ym')
                ->orderBy('ym', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT DATE_FORMAT(created_at, "%Y-%m") AS ym, SUM(amount_payment) AS total
FROM `payments`
WHERE `status_payment` = 'Aprovado'
AND `created_at` >= '2025-06-01 00:00:00'
GROUP BY `ym`
ORDER BY `ym` ASC


        try {
            $since14 = date('Y-m-d 00:00:00', $now - (14 * 24 * 60 * 60));
            $enRows = $db->table('enrollments')
                ->select('DATE(created_at) AS d, COUNT(*) AS total', false)
                ->where('created_at >=', $since14)
                ->groupBy('d')
                ->orderBy('d', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT DATE(created_at) AS d, COUNT(*) AS total
FROM `enrollments`
WHERE `created_at` >= '2026-05-06 00:00:00'
GROUP BY `d`
ORDER BY `d` ASC

    public function students()
    {
        $user = service('auth')->user();
        $db = db_connect();
        $courses = $db->table('courses')
            ->select('id_course, title_course')
            ->orderBy('title_course', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `id_course`, `title_course`
FROM `courses`
ORDER BY `title_course` ASC