app/Controllers/Instructor/CourseController.php


        if ($modulesProvided) {
            // apagar e recriar
            $oldModules = $moduleModel->where('id_course_module', $id)->findAll();
            foreach ($oldModules as $mod) {
                $lessonModel->where('id_module_lesson', $mod->id_module)->delete();
            }
            $moduleModel->where('id_course_module', $id)->delete();
---
SELECT *
FROM `modules`
WHERE `id_course_module` = '22'
DELETE FROM `lessons`
WHERE `id_module_lesson` = '593'
DELETE FROM `modules`
WHERE `id_course_module` = '22'

                        'position_module' => $mIndex + 1,
                    ]);

                    $moduleId = $moduleModel->insertID();
---
INSERT INTO `modules` (`id_course_module`, `title_module`, `description_module`, `content_zip_module`, `min_score_module`, `position_module`) VALUES ('22', 'Módulo 01 - HTML', 'Neste módulo, você aprenderá a base de toda página da internet: o HTML (HyperText Markup Language). É aqui que começa a construção de qualquer site.', NULL, 75, 1)

                        $attachmentPath = $attachment['path'] ?? ($lesson['file_existing'] ?? null);
                        $attachmentName = $attachment['name'] ?? ($lesson['file_existing_name'] ?? null);

                        $lessonModel->insert([
                            'id_module_lesson' => $moduleId,
                            'title_lesson' => $lesson['title'] ?? 'Aula',
                            'type_lesson' => $lesson['type'] ?? 'text',
                            'content_lesson' => $lessonContent,
                            'attachment_path_lesson' => $attachmentPath,
                            'attachment_name_lesson' => $attachmentName,
                            'duration_lesson' => (int) ($lesson['duration'] ?? 0),
                            'video_url_lesson' => $lesson['video_url'] ?? null,
                            'position_lesson' => $lIndex + 1,
                        ]);
---
INSERT INTO `lessons` (`id_module_lesson`, `title_lesson`, `type_lesson`, `content_lesson`, `attachment_path_lesson`, `attachment_name_lesson`, `duration_lesson`, `video_url_lesson`, `is_preview_lesson`, `position_lesson`) VALUES (681, '01 - Sintaxe e Tag', 'video', NULL, '1769681378_51f2d2270441308a152e.zip', 'Fundo.zip', 11, 'https://vimeo.com/1158395497?share=copy', 1, 1)

        }

        if ($projectsProvided) {
            $projectModel->where('id_course_project', $id)->delete();
---
DELETE FROM `projects`
WHERE `id_course_project` = '22'