app/Controllers/Instructor/Dashboard.php

    public function add_course()
    {
        $user = service('auth')->user();
        $courseModel = new CourseModel();
        $moduleModel = new ModuleModel();
        $lessonModel = new LessonModel();

        $draft = $courseModel
            ->where('id_instructor_course', $user->id)
            ->where('status_course', 'Rascunho')
            ->orderBy('updated_at', 'DESC')
            ->first();

        $draftModules = [];
        if ($draft) {
            $draftModules = $moduleModel
                ->where('id_course_module', $draft->id_course)
                ->orderBy('position_module')
                ->findAll();

            foreach ($draftModules as &$m) {
                $m->lessons = $lessonModel
                    ->where('id_module_lesson', $m->id_module)
                    ->orderBy('position_lesson')
                    ->findAll();
---
SELECT *
FROM `modules`
WHERE `id_course_module` = '18'
ORDER BY `position_module`
SELECT *
FROM `lessons`
WHERE `id_module_lesson` = '17'
ORDER BY `position_lesson`