app/Controllers/Student/Dashboard.php


        // Helper para calcular a aula de retomada (resume) por curso/enrollment
        $calcResume = function (int $courseId, int $enrollmentId) use ($db) {
            $ordered = $db->table('lessons l')
                ->select('l.id_lesson')
                ->join('modules m', 'm.id_module = l.id_module_lesson')
                ->where('m.id_course_module', $courseId)
                ->orderBy('m.position_module', 'ASC')
                ->orderBy('l.position_lesson', 'ASC')
                ->get()->getResultArray();
---
SELECT `lessons`.`id_lesson`
FROM `lessons`
JOIN `modules` ON `modules`.`id_module` = `lessons`.`id_module_lesson`
WHERE `modules`.`id_course_module` = '18'
ORDER BY `modules`.`position_module` ASC, `lessons`.`position_lesson` ASC
 LIMIT 1

    public function my_courses()
    {
        $enrollmentModel = new \App\Models\EnrollmentModel();
        $lessonModel     = new \App\Models\LessonModel();
        $db              = db_connect();

        $user = service('auth')->user();

        // Cursos nos quais o aluno está inscrito (função custom)
        $courses = $enrollmentModel->getStudentEnrolledCourses($user->id);

        // Todas as matrículas do aluno
        $enrollments = $enrollmentModel
            ->where('id_student_enrollment', $user->id)
            ->findAll();
---
SELECT *
FROM `enrollments`
WHERE `id_student_enrollment` = 19


        // Helper: retorna a aula de retomada (primeira não concluída; se todas, a última)
        $calcResume = function (int $courseId, int $enrollmentId) use ($db) {
            $ordered = $db->table('lessons l')
                ->select('l.id_lesson')
                ->join('modules m', 'm.id_module = l.id_module_lesson')
                ->where('m.id_course_module', $courseId)
                ->orderBy('m.position_module', 'ASC')
                ->orderBy('l.position_lesson', 'ASC')
                ->get()->getResultArray();
---
SELECT `l`.`id_lesson`
FROM `lessons` `l`
JOIN `modules` `m` ON `m`.`id_module` = `l`.`id_module_lesson`
WHERE `m`.`id_course_module` = 18
ORDER BY `m`.`position_module` ASC, `l`.`position_lesson` ASC

            $orderedIds = array_map(fn($r) => (int)$r['id_lesson'], $ordered);
            if (empty($orderedIds)) return null;

            $completedLessonIds = array_column(
                $db->table('progress')
                    ->select('id_lesson_progress')
                    ->where('id_enrollment_progress', $enrollmentId)
                    ->where('completed_at_progress IS NOT NULL', null, false)
                    ->get()->getResultArray(),
                'id_lesson_progress'
            );
---
SELECT `id_lesson_progress`
FROM `progress`
WHERE `id_enrollment_progress` = 43
AND completed_at_progress IS NOT NULL

    public function lessons($id)
    {
        $lessonModel     = new LessonModel();
        $moduleModel     = new ModuleModel();
        $courseModel     = new CourseModel();
        $enrollmentModel = new EnrollmentModel();
        $db              = db_connect();

        // Usuário atual
        $authUser = service('auth')->user();
        if (! $authUser) {
            return redirect()->to(site_url('login'))
                ->with('error', 'Sessão expirada. Faça login novamente.');
        }
        $userId = function_exists('user_id') ? user_id() : ($authUser->id ?? $authUser->getId());

        $id = (int) $id;

        // Helper para calcular retomada e ordem global (por curso)
        $calcResume = function (int $courseId, int $enrollmentId) use ($db) {
            $ordered = $db->table('lessons l')
                ->select('l.id_lesson')
                ->join('modules m', 'm.id_module = l.id_module_lesson')
                ->where('m.id_course_module', $courseId)
                ->orderBy('m.position_module', 'ASC')
                ->orderBy('l.position_lesson', 'ASC')
                ->get()->getResultArray();
---
SELECT `l`.`id_lesson`
FROM `lessons` `l`
JOIN `modules` `m` ON `m`.`id_module` = `l`.`id_module_lesson`
WHERE `m`.`id_course_module` = 18
ORDER BY `m`.`position_module` ASC, `l`.`position_lesson` ASC

            }

            // Concluídas POR ESTA MATRÍCULA
            $completedLessonIds = array_column(
                $db->table('progress')
                    ->select('id_lesson_progress')
                    ->where('id_enrollment_progress', $enrollmentId)
                    ->where('completed_at_progress IS NOT NULL', null, false)
                    ->get()->getResultArray(),
                'id_lesson_progress'
            );
---
SELECT `id_lesson_progress`
FROM `progress`
WHERE `id_enrollment_progress` = 84
AND completed_at_progress IS NOT NULL

            }

            // MATRÍCULA do usuário logado nesse curso
            $enrollment = $enrollmentModel
                ->where('id_course_enrollment',  (int) $course->id_course)
                ->where('id_student_enrollment', (int) $userId)   // <<< FILTRO PELO ESTUDANTE
                ->first();

            if (! $enrollment) {
                return redirect()->to('/student/dashboard/checkout/' . (int) $course->id_course)
                    ->with('warning', 'Você precisa estar inscrito neste curso.');
---
SELECT *
FROM `enrollments`
WHERE `id_course_enrollment` = 18
AND `id_student_enrollment` = 19
 LIMIT 1
SELECT *
FROM `courses`
WHERE `courses`.`id_course` = '18'

            ->first();

        if (! $enrollment) {
            return redirect()->to('/student/dashboard/checkout/' . (int) $course->id_course)
                ->with('warning', 'Você precisa estar inscrito neste curso.');
---
SELECT *
FROM `courses`
WHERE `courses`.`id_course` = '18'