app/Controllers/Student/Dashboard.php

    public function index()
    {
        $auth = service('auth');
        $user = $auth->user();

        $coursesModel     = new CourseModel();
        $enrollmentModel  = new \App\Models\EnrollmentModel();
        $lessonModel      = new \App\Models\LessonModel();
        $db               = db_connect();

        // Todos os cursos (se ainda usa na home)
        $courses = $coursesModel->findAll();

        // Inscrições do usuário
        $enrollments = $enrollmentModel
            ->where('id_student_enrollment', $user->id)
            ->findAll();
---
SELECT *
FROM `courses`
SELECT *
FROM `enrollments`
WHERE `id_student_enrollment` = 107


        // Helper para calcular a aula de retomada (resume) por curso/enrollment
        $calcResume = function (int $courseId, int $enrollmentId) use ($db) {
            $ordered = $db->table('lessons l')
                ->select('l.id_lesson')
                ->join('modules m', 'm.id_module = l.id_module_lesson')
                ->where('m.id_course_module', $courseId)
                ->orderBy('m.position_module', 'ASC')
                ->orderBy('l.position_lesson', 'ASC')
                ->get()->getResultArray();
---
SELECT `l`.`id_lesson`
FROM `lessons` `l`
JOIN `modules` `m` ON `m`.`id_module` = `l`.`id_module_lesson`
WHERE `m`.`id_course_module` = 18
ORDER BY `m`.`position_module` ASC, `l`.`position_lesson` ASC


            if (empty($orderedIds)) return null;

            $completedLessonIds = array_column(
                $db->table('progress')
                    ->select('id_lesson_progress')
                    ->where('id_enrollment_progress', $enrollmentId)
                    ->where('completed_at_progress IS NOT NULL', null, false)
                    ->get()->getResultArray(),
                'id_lesson_progress'
            );
---
SELECT `id_lesson_progress`
FROM `progress`
WHERE `id_enrollment_progress` = 15
AND completed_at_progress IS NOT NULL

            $orderedIds = array_map(fn($r) => (int)$r['id_lesson'], $ordered);
            if (empty($orderedIds)) return null;

            $completedLessonIds = array_column(
                $db->table('progress')
                    ->select('id_lesson_progress')
                    ->where('id_enrollment_progress', $enrollmentId)
                    ->where('completed_at_progress IS NOT NULL', null, false)
                    ->get()->getResultArray(),
                'id_lesson_progress'
            );
---
SELECT `id_lesson_progress`
FROM `progress`
WHERE `id_enrollment_progress` = '12'
AND completed_at_progress IS NOT NULL

    public function lessons($id)
    {
        $lessonModel     = new LessonModel();
        $moduleModel     = new ModuleModel();
        $courseModel     = new CourseModel();
        $enrollmentModel = new EnrollmentModel();
        $db              = db_connect();

        $authUser = service('auth')->user();
        $userId   = function_exists('user_id') ? user_id() : ($authUser->id ?? $authUser->getId());

        $id = (int) $id;

        // Helper para calcular retomada e ordem global
        $calcResume = function (int $courseId, int $enrollmentId) use ($db) {
            $ordered = $db->table('lessons l')
                ->select('l.id_lesson')
                ->join('modules m', 'm.id_module = l.id_module_lesson')
                ->where('m.id_course_module', $courseId)
                ->orderBy('m.position_module', 'ASC')
                ->orderBy('l.position_lesson', 'ASC')
                ->get()->getResultArray();
            $orderedIds = array_map(fn($r) => (int)$r['id_lesson'], $ordered);

            if (empty($orderedIds)) {
                return [null, $orderedIds];
            }

            $completedLessonIds = array_column(
                $db->table('progress')
                    ->select('id_lesson_progress')
                    ->where('id_enrollment_progress', $enrollmentId)
                    ->where('completed_at_progress IS NOT NULL', null, false)
                    ->get()->getResultArray(),
                'id_lesson_progress'
            );
---
SELECT `l`.`id_lesson`
FROM `lessons` `l`
JOIN `modules` `m` ON `m`.`id_module` = `l`.`id_module_lesson`
WHERE `m`.`id_course_module` = 18
ORDER BY `m`.`position_module` ASC, `l`.`position_lesson` ASC
SELECT `id_lesson_progress`
FROM `progress`
WHERE `id_enrollment_progress` = 12
AND completed_at_progress IS NOT NULL

        }

        // Aula válida → obter módulo/curso
        $module = $moduleModel->find($lesson->id_module_lesson);
        $course = $courseModel->find($module->id_course_module);

        // matrícula do usuário no curso
        $enrollment = $enrollmentModel
            ->where('id_course_enrollment', $course->id_course)
            ->first();
---
SELECT *
FROM `modules`
WHERE `modules`.`id_module` = '17'
SELECT *
FROM `courses`
WHERE `courses`.`id_course` = '18'
SELECT *
FROM `enrollments`
WHERE `id_course_enrollment` = '18'
 LIMIT 1

        }

        // Sidebar: módulos + aulas (sem interferir em prev/next)
        $modules = $moduleModel->where('id_course_module', $course->id_course)
            ->orderBy('position_module')->findAll();
        foreach ($modules as &$m) {
            $m->lessons = $lessonModel->where('id_module_lesson', $m->id_module)
                ->orderBy('position_lesson')->findAll();
---
SELECT *
FROM `modules`
WHERE `id_course_module` = '18'
ORDER BY `position_module`
SELECT *
FROM `lessons`
WHERE `id_module_lesson` = '17'
ORDER BY `position_lesson`

        unset($m);

        // Concluídas (para checkboxes)
        $completedLessonIds = array_column(
            $db->table('progress')
                ->select('id_lesson_progress')
                ->where('id_enrollment_progress', $enrollment->id_enrollment)
                ->where('completed_at_progress IS NOT NULL', null, false)
                ->get()->getResultArray(),
            'id_lesson_progress'
        );
---
SELECT `id_lesson_progress`
FROM `progress`
WHERE `id_enrollment_progress` = '12'
AND completed_at_progress IS NOT NULL