app/Controllers/Student/LessonDiscussions.php

INSERT INTO `lesson_discussions` (`id_lesson_discussion`, `id_course_discussion`, `id_user_discussion`, `id_parent_discussion`, `body_discussion`, `created_at`, `updated_at`) VALUES (5480, 25, 113, NULL, 'ola', '2026-07-23 11:54:06', '2026-07-23 11:54:06')
---
        }

        $now = date('Y-m-d H:i:s');
        $id = $model->insert([
            'id_lesson_discussion'  => $lessonId,
            'id_course_discussion'  => (int) $lesson['id_course'],
            'id_user_discussion'    => (int) $user->id,
            'id_parent_discussion'  => $parentId > 0 ? $parentId : null,
            'body_discussion'       => $body,
            'created_at'            => $now,
            'updated_at'            => $now,
        ], true);

SELECT `l`.`id_lesson`, `l`.`title_lesson`, `m`.`id_course_module` AS `id_course`, `c`.`id_instructor_course`
FROM `lessons` `l`
INNER JOIN `modules` `m` ON `m`.`id_module` = `l`.`id_module_lesson`
INNER JOIN `courses` `c` ON `c`.`id_course` = `m`.`id_course_module`
WHERE `l`.`id_lesson` = 5480
---
    private function authorizeLessonAccess(int $lessonId)
    {
        $user = auth()->user();
        if (! $user) {
            return $this->response->setStatusCode(401)->setJSON([
                'ok' => false,
                'message' => 'Faça login para participar na discussão.',
            ]);
        }

        $db = db_connect();
        $lesson = $db->table('lessons l')
            ->select('l.id_lesson, l.title_lesson, m.id_course_module AS id_course, c.id_instructor_course')
            ->join('modules m', 'm.id_module = l.id_module_lesson', 'inner')
            ->join('courses c', 'c.id_course = m.id_course_module', 'inner')
            ->where('l.id_lesson', $lessonId)
            ->get()
            ->getRowArray();

SELECT *
FROM `enrollments`
WHERE `id_student_enrollment` = 113
AND `id_course_enrollment` = 25
AND `status_enrollment` IN ('ativa','pendente')
 LIMIT 1
---
        } elseif ($role === 'instructor' && (int) $lesson['id_instructor_course'] === (int) $user->id) {
            $allowed = true;
        } elseif ($role === 'student') {
            $enrollment = (new EnrollmentModel())
                ->where('id_student_enrollment', (int) $user->id)
                ->where('id_course_enrollment', (int) $lesson['id_course'])
                ->whereIn('status_enrollment', ['ativa', 'pendente'])
                ->first();