app/Controllers/Student/LessonsController.php

    public function uncomplete()
    {
        $payload      = $this->request->getJSON(true);
        $idLesson     = (int)($payload['lesson_id'] ?? 0);
        $idEnrollment = (int)($payload['enrollment_id'] ?? 0);

        if (!$idLesson || !$idEnrollment) {
            return $this->response->setJSON(['ok' => false, 'message' => 'Parâmetros inválidos']);
        }

        $db = db_connect();

        // opção A: manter linha e zerar data
        $db->table('progress')
            ->where('id_enrollment_progress', $idEnrollment)
            ->where('id_lesson_progress', $idLesson)
            ->update(['completed_at_progress' => null, 'updated_at' => date('Y-m-d H:i:s')]);

        // (ou opção B: deletar a linha)

        $percent = (new ProgressService($db))->recalcAndSave($idEnrollment);

        if ($percent < 100) {
            $db->table('enrollments')
                ->where('id_enrollment', $idEnrollment)
                ->update(['completed_enrollment' => null]);
---
UPDATE `progress` SET `completed_at_progress` = NULL, `updated_at` = '2026-01-22 18:17:11'
WHERE `id_enrollment_progress` = 42
AND `id_lesson_progress` = 321
UPDATE `enrollments` SET `completed_enrollment` = NULL
WHERE `id_enrollment` = 42