app/Controllers/MpesaController.php

SELECT *
FROM `courses`
WHERE `status_course` = 'Ativo'
AND `courses`.`id_course` = 26
---
    public function send(): ResponseInterface
    {
        helper(['form']);

        $authenticatedUser = auth()->user();
        $rules = [
            'id_course'     => 'required|integer',
            'client_number' => 'required|min_length[9]|max_length[15]',
        ];

        if (! $authenticatedUser) {
            $rules['email'] = 'required|valid_email';
            $rules['username'] = 'required|min_length[3]|max_length[100]';
        }

        if (! $this->validate($rules)) {
            return $this->jsonResponse(422, [
                'ok'   => false,
                'swal' => [
                    'icon'  => 'error',
                    'title' => 'Dados invalidos',
                    'text'  => implode(' | ', $this->validator->getErrors()),
                ],
            ]);
        }

        $courseId = (int) $this->request->getPost('id_course');
        $course = (new CourseModel())
            ->where('status_course', 'Ativo')
            ->find($courseId);

SELECT *
FROM `payments`
WHERE `id_payment` = 124
AND `reference_payment` = 'CRS26U105T177377309684'
 LIMIT 1
---
        $fullName = trim((string) ($authenticatedUser->username ?? $this->request->getPost('username')));

        $paymentModel = new PaymentModel();
        $payment = $paymentModel
            ->where('id_payment', $paymentId)
            ->where('reference_payment', $reference)
            ->first();