app/Controllers/PageController.php

    private function getCourseContentStats(int $courseId, $course = null): array
    {
        $lessonModel = new LessonModel();
        $moduleModel = new ModuleModel();
        $projectModel = new ProjectModel();
        $commerce = new \App\Services\CourseCommerceService();

        $moduleCount = $moduleModel
            ->where('id_course_module', $courseId)
            ->countAllResults();

        $lessonCount = $lessonModel
            ->join('modules m', 'm.id_module = lessons.id_module_lesson', 'inner')
            ->where('m.id_course_module', $courseId)
            ->countAllResults();

        $totalMinutesRow = \Config\Database::connect()
            ->table('modules m')
            ->select('COALESCE(SUM(l.duration_lesson), 0) AS total_minutes', false)
            ->join('lessons l', 'l.id_module_lesson = m.id_module', 'left')
            ->where('m.id_course_module', $courseId)
            ->get()
            ->getRow();

        $totalMinutes = (int) ($totalMinutesRow->total_minutes ?? 0);
        if ($course === null) {
            $course = (new CourseModel())->find($courseId);
        }

        $projectCount = $projectModel
            ->where('id_course_project', $courseId)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `modules`
WHERE `id_course_module` = 22
SELECT COUNT(*) AS `numrows`
FROM `lessons`
INNER JOIN `modules` `m` ON `m`.`id_module` = `lessons`.`id_module_lesson`
WHERE `m`.`id_course_module` = 22
SELECT COALESCE(SUM(l.duration_lesson), 0) AS total_minutes
FROM `modules` `m`
LEFT JOIN `lessons` `l` ON `l`.`id_module_lesson` = `m`.`id_module`
WHERE `m`.`id_course_module` = 22
SELECT *
FROM `courses`
WHERE `courses`.`id_course` = '18'
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE `id_course_project` = 22

    public function index($id_course)
    {
        $courseModel = new CourseModel();
        $user = service('auth')->user();

        $course = $courseModel
            ->where('status_course', 'Ativo')
            ->find($id_course);
---
SELECT *
FROM `courses`
WHERE `status_course` = 'Ativo'
AND `courses`.`id_course` = '22'

    public function startTrial(int $id_course)
    {
        $user = service('auth')->user();
        $lessonsPath = 'student/dashboard/ver_aulas/' . $id_course;
        $trialPath   = 'courses/' . $id_course . '/trial';

        if (! $user) {
            session()->setTempdata('beforeLoginUrl', $trialPath, 600);

            return redirect()->to(site_url('login'))
                ->with('error', 'Faça login como aluno para experimentar o curso.');
        }

        $role = strtolower(trim((string) ($user->role ?? '')));
        if ($role !== 'student') {
            return redirect()->to(site_url('courses/' . $id_course))
                ->with('error', 'Apenas contas de aluno podem experimentar aulas grátis.');
        }

        $courseModel = new CourseModel();
        $course = $courseModel->where('status_course', 'Ativo')->find($id_course);
---
SELECT *
FROM `courses`
WHERE `status_course` = 'Ativo'
AND `courses`.`id_course` = 27

        }

        $enrollmentModel = new \App\Models\EnrollmentModel();
        $existing = $enrollmentModel
            ->where('id_student_enrollment', (int) $user->id)
            ->where('id_course_enrollment', (int) $course->id_course)
            ->first();
---
SELECT *
FROM `enrollments`
WHERE `id_student_enrollment` = 114
AND `id_course_enrollment` = 27
 LIMIT 1