app/Controllers/PageController.php

    public function index($id_course)
    {
        $courseModel = new CourseModel();
        $user = service('auth')->user();

        $course = $courseModel->find($id_course);
---
SELECT *
FROM `courses`
WHERE `courses`.`id_course` = '19'

    public function excel($id_course)
    {

        $lessonModel     = new LessonModel();
        $moduleModel     = new ModuleModel();
        $courseModel = new CourseModel();
        $user = service('auth')->user();

        $course = $courseModel->find($id_course);

        $enrollmentModel = new \App\Models\EnrollmentModel();
        $userId = $user ? $user->id : null;

        $module = $moduleModel
            ->select('id_module, title_module, position_module, description_module') // opcional: só as colunas que precisa
            ->where('id_course_module', $id_course)
            ->orderBy('position_module', 'ASC')
            ->findAll();

        $isEnrolled = false;
        if ($userId) {
            $isEnrolled = $enrollmentModel
                ->where('id_student_enrollment', $userId)
                ->where('id_course_enrollment', $course->id_course)
                ->where('status_enrollment', 'Ativa')
                ->first();
---
SELECT `id_module`, `title_module`, `position_module`, `description_module`
FROM `modules`
WHERE `id_course_module` = '18'
ORDER BY `position_module` ASC
SELECT *
FROM `enrollments`
WHERE `id_student_enrollment` = 15
AND `id_course_enrollment` = '18'
AND `status_enrollment` = 'Ativa'
 LIMIT 1