app/Models/CertificateModel.php

    public function getForInstructorDashboard(int $instructorUserId): array
    {
        return $this->db->table('certificates cert')
            ->select('cert.*, c.title_course, c.image_course, u.username AS student_name, e.id_enrollment AS enrollment_id')
            ->join('courses c', 'c.id_course = cert.id_course_certificate', 'inner')
            ->join('users u', 'u.id = cert.id_user_certificate', 'inner')
            ->join('enrollments e', 'e.id_student_enrollment = cert.id_user_certificate AND e.id_course_enrollment = cert.id_course_certificate', 'left')
            ->where('c.id_instructor_course', $instructorUserId)
            ->orderBy('cert.created_at', 'DESC')
            ->get()
            ->getResult();
---
SELECT `cert`.*, `c`.`title_course`, `c`.`image_course`, `u`.`username` AS `student_name`, `e`.`id_enrollment` AS `enrollment_id`
FROM `certificates` `cert`
INNER JOIN `courses` `c` ON `c`.`id_course` = `cert`.`id_course_certificate`
INNER JOIN `users` `u` ON `u`.`id` = `cert`.`id_user_certificate`
LEFT JOIN `enrollments` `e` ON `e`.`id_student_enrollment` = `cert`.`id_user_certificate` AND `e`.`id_course_enrollment` = `cert`.`id_course_certificate`
WHERE `c`.`id_instructor_course` = 1
ORDER BY `cert`.`created_at` DESC