app/Models/CourseModel.php

    public function getCoursesByInstructor($instructorId)
    {
        return $this->where('id_instructor_course', $instructorId)->findAll();
---
SELECT *
FROM `courses`
WHERE `id_instructor_course` = 1