app/Models/EnrollmentModel.php

    public function getStudentEnrolledCourses($studentId)
    {
        return $this->select('
                    enrollments.id_enrollment,
                    enrollments.enrolled_at_enrollment,
                    enrollments.status_enrollment,

                    students.id_student,
                    students.name_student,
                    students.email_student,

                    courses.id_course,
                    courses.title_course,
                    courses.image_course,
                    courses.description_course,
                    courses.price_course,

                    users.id,
                    users.username,
                ')
            ->join('students', 'students.id_user_student = enrollments.id_student_enrollment')
            ->join('courses', 'courses.id_course = enrollments.id_course_enrollment')
            ->join('users', 'users.id = courses.id_instructor_course') // join com instrutor
            ->where('enrollments.id_student_enrollment', $studentId)
            ->findAll();
---
SELECT `enrollments`.`id_enrollment`, `enrollments`.`enrolled_at_enrollment`, `enrollments`.`status_enrollment`, `students`.`id_student`, `students`.`name_student`, `students`.`email_student`, `courses`.`id_course`, `courses`.`title_course`, `courses`.`image_course`, `courses`.`description_course`, `courses`.`price_course`, `users`.`id`, `users`.`username`
FROM `enrollments`
JOIN `students` ON `students`.`id_user_student` = `enrollments`.`id_student_enrollment`
JOIN `courses` ON `courses`.`id_course` = `enrollments`.`id_course_enrollment`
JOIN `users` ON `users`.`id` = `courses`.`id_instructor_course`
WHERE `enrollments`.`id_student_enrollment` = 113