app/Models/EnrollmentModel.php

SELECT `enrollments`.`id_enrollment`, `enrollments`.`enrolled_at_enrollment`, `enrollments`.`status_enrollment`, `students`.`id_student`, `students`.`name_student`, `students`.`email_student`, `courses`.`id_course`, `courses`.`title_course`, `courses`.`image_course`, `courses`.`description_course`, `courses`.`price_course`, `instructors`.`id_instructor`, `instructors`.`name_instructor`, `instructors`.`email_instructor`
FROM `enrollments`
JOIN `students` ON `students`.`id_user_student` = `enrollments`.`id_student_enrollment`
JOIN `courses` ON `courses`.`id_course` = `enrollments`.`id_course_enrollment`
JOIN `instructors` ON `instructors`.`id_instructor` = `courses`.`id_instructor_course`
WHERE `enrollments`.`id_student_enrollment` = 107
---
public function getStudentEnrolledCourses($studentId)
{
    return $this->select('
                    enrollments.id_enrollment,
                    enrollments.enrolled_at_enrollment,
                    enrollments.status_enrollment,

                    students.id_student,
                    students.name_student,
                    students.email_student,

                    courses.id_course,
                    courses.title_course,
                    courses.image_course,
                    courses.description_course,
                    courses.price_course,

                    instructors.id_instructor,
                    instructors.name_instructor,
                    instructors.email_instructor
                ')
        ->join('students', 'students.id_student = enrollments.id_student_enrollment')
        ->join('courses', 'courses.id_course = enrollments.id_course_enrollment')
        ->join('instructors', 'instructors.id_instructor = courses.id_instructor_course') // join com instrutor
        ->where('enrollments.id_student_enrollment', $studentId)
        ->findAll();