app/Models/LessonDiscussionModel.php

    public function forLesson(int $lessonId, int $limit = 100): array
    {
        $rows = $this->db->table('lesson_discussions d')
            ->select('d.*, u.username, u.img')
            ->join('users u', 'u.id = d.id_user_discussion', 'left')
            ->where('d.id_lesson_discussion', $lessonId)
            ->orderBy('d.created_at', 'ASC')
            ->orderBy('d.id_discussion', 'ASC')
            ->limit(max(1, min(200, $limit)))
            ->get()
            ->getResultArray();
---
SELECT `d`.*, `u`.`username`, `u`.`img`
FROM `lesson_discussions` `d`
LEFT JOIN `users` `u` ON `u`.`id` = `d`.`id_user_discussion`
WHERE `d`.`id_lesson_discussion` = 5480
ORDER BY `d`.`created_at` ASC, `d`.`id_discussion` ASC
 LIMIT 150