app/Models/UserNotificationModel.php

    public function unreadCount(int $userId): int
    {
        if ($userId <= 0) {
            return 0;
        }

        return (int) $this->where('user_id', $userId)
            ->where('read_at', null)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user_notifications`
WHERE `user_id` = 125
AND `read_at` IS NULL